# import pandas

In [1]:
import pandas as pd

In [16]:
df=pd.read_csv('users_manga.csv')

# fix index

In [18]:
df.columns=['Username','manga_id','rating']

# clean data

In [19]:
df['Username'] = df['Username'].str.replace("'", "")

In [51]:
df['Username'] = df['Username'].str.replace('[' ,"")
df['rating'] = df['rating'].str.replace(']' ,"")

C:\Users\15623\AppData\Local\Temp\ipykernel_10080\678018875.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  df['Username'] = df['Username'].str.replace('[' ,"")
C:\Users\15623\AppData\Local\Temp\ipykernel_10080\678018875.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  df['rating'] = df['rating'].str.replace(']' ,"")

In [53]:
df.head()

  Username  manga_id rating
0   904jed         2      8
1   904jed     75989      8
2   904jed     95210     10
3   904jed      4608      0
4   904jed      1528     10

In [54]:
isinstance(df['rating'], float )

False

# convert string to numeric

In [55]:
df['rating']=pd.to_numeric(df['rating'])

In [56]:
df['manga_id']=pd.to_numeric(df['manga_id'])

In [57]:
df.head()

  Username  manga_id  rating
0   904jed         2       8
1   904jed     75989       8
2   904jed     95210      10
3   904jed      4608       0
4   904jed      1528      10

In [58]:
df['manga_id'].mode()

0    116778
dtype: int64

In [59]:
df.head()

  Username  manga_id  rating
0   904jed         2       8
1   904jed     75989       8
2   904jed     95210      10
3   904jed      4608       0
4   904jed      1528      10

# repeat for second df

In [66]:
df2=pd.read_csv('users_manga2.csv')

In [69]:
df2.columns=['Username','manga_id','rating']

In [70]:
df2['Username'] = df2['Username'].str.replace("'", "")

In [71]:
df2.head()

   Username manga_id rating
0  [ryo-san    21582     0]
1  [ryo-san    92683     8]
2  [ryo-san    60993     0]
3  [ryo-san    94175     9]
4  [ryo-san   114451     9]

In [72]:
df2['Username'] = df2['Username'].str.replace('[' ,"")
df2['rating'] = df2['rating'].str.replace(']' ,"")

C:\Users\15623\AppData\Local\Temp\ipykernel_10080\2701373.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  df2['Username'] = df2['Username'].str.replace('[' ,"")
C:\Users\15623\AppData\Local\Temp\ipykernel_10080\2701373.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  df2['rating'] = df2['rating'].str.replace(']' ,"")

In [73]:
df2['rating']=pd.to_numeric(df2['rating'])
df2['manga_id']=pd.to_numeric(df2['manga_id'])

In [74]:
df.head()

  Username  manga_id  rating
0   904jed         2       8
1   904jed     75989       8
2   904jed     95210      10
3   904jed      4608       0
4   904jed      1528      10

In [75]:
df2.head()

  Username  manga_id  rating
0  ryo-san     21582       0
1  ryo-san     92683       8
2  ryo-san     60993       0
3  ryo-san     94175       9
4  ryo-san    114451       9

# JOIN 2 DF

In [76]:
user_manga=pd.concat([df, df2], ignore_index=True)

In [77]:
user_manga

       Username  manga_id  rating
0        904jed         2       8
1        904jed     75989       8
2        904jed     95210      10
3        904jed      4608       0
4        904jed      1528      10
...         ...       ...     ...
98495  Zoneling    141506       5
98496  Zoneling    122925       4
98497  Zoneling    126037       4
98498  Zoneling    124373       5
98499  Zoneling     89087       6

[98500 rows x 3 columns]

In [78]:
user_manga.to_csv('mal_users_manga.csv', index=False)